/**
 * Граф
 * Стуктура, состоящая из вершин и ребер.
 */


/**
 * Граф в виде списка смежности
 */
const graph = {
    a: ['b', 'c'],
    b: ['e'],
    c: ['f', 'd'],
    d: ['e'],
    f: ['e'],
    e: ['g']
};

const weightedGraph = {
    a: {b: 5, c: 2},
    b: {c: 3, d: 6},
    c: {d: 4},
};

/**
 * Граф в виде матрицы смежности
 */
const matrix = [
    [0, 1, 1, 0],
    [1, 0, 0, 1],
    [1, 0, 0, 1],
    [0, 1, 1, 0]
];

const weightedMatrix = [
    [0, 5, 2, 0],
    [0, 0, 3, 6],
    [0, 0, 0, 4],
    [0, 0, 0, 0]
];
